/*======================================
用静态单链表来实现线性表
借用一维数组来描述线性链表
线性表的链式表示和实现
=======================================*/
#include <stdio.h>
#include <stdlib.h>
#include "2staticlinklinearlist.h"

/*==========================================================
下面是对静态单链表的操作
==========================================================*/
int InitSpace_SL(SLinkList *space) //将一维数组space中各分量链成一个备用链表，书本算法2.14
{                                  //即将整个数组空间初始化成一个链表
    int i = 0;
    for (; i < MAXSIZE; i++)
        (*space)[i].cur = i + 1;   //（ *space）[0].cur为头指针
    (*space)[MAXSIZE - 1].cur = 0; //0表示空指针
}
